// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Kumoa";
"SHUTDOWN_BUTTON"	= "Sammuta";
"SKIP_BUTTON"		= "Ohita";
"QUIT_BUTTON"		= "Lopeta";
"GO_BUTTON"		= "Valmis";

"CONNECT_BUTTON"	= "Yhdistä";
"CONTINUE_BUTTON"	= "Jatka";
"RECONNECT_BUTTON"	= "Yritä uudelleen";
"GO_BACK_BUTTON"	= "Takaisin";
"REGISTER_LATER_BUTTON"	= "Myöhemmin";
"DONT_ACCEPT_BUTTON"	= "Älä hyväksy";
"LEARNMORE_BUTTON"	= "Lisätietoja";

"SYSTEM_PREFERENCES_BUTTON" = "Avaa Järjestelmäasetukset";

"SYSTEM_PREFERENCES" = "Järjestelmäasetukset";

// HEADING_FONT : use legal postscript name [4890740]
"HEADING_FONT" = "LucidaGrande"; 
"HEADING_SIZE" = "42";
"HEADING_KERNING" = "-2";

"REGISTRATION_FILE_PATH" = "%@/Library/Assistants/Send Registration.setup";
"REGISTRATION_FILE_ALIAS_PATH" = "%@/Send Registration";

"LOCAL_ADMIN_SHORT_NAME" = "admin";
"LOCAL_ADMIN_FULL_NAME" = "Ylläpitäjä";

"OTHER_AIRPORT_NETWORK" = "Muu verkko";
// ---------------------------------------------------------------------
// * Migration
// ---------------------------------------------------------------------
"Successfully connected to the other Mac..." = "Yhteydenmuodostus toiseen Maciin onnistui...";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "Määritellään tietokonetta…";
"MESSAGE_PREP_CONNECTION"	= "Valmistellaan yhteyden muodostamista…";
"MESSAGE_CONNECTING"		= "Yhdistetään Appleen…";
"MESSAGE_DISCONNECTING"		= "Katkaistaan…";
"MESSAGE_REGISTRATION_SENT"	= "Rekisteröintisi lähetettiin Applelle.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_STARTUP_CANNOT_RUN_TITLE"		= "Käyttöönottoapuria ei voida käyttää tietokoneen käyttöönottoasetuksia suoritettaessa.";
"MESSAGE_STARTUP_CANNOT_RUN"			= "Muuta tietokoneesi asetuksia valitsemalla sen sijaan Apple () > Järjestelmäasetukset.";

"MESSAGE_MONITOR_CANNOT_RUN_TITLE"		= "Mac OS X -käyttöönottoapuria ei voida käyttää tämän näytön kanssa.";
"MESSAGE_MONITOR_CANNOT_RUN"			= "Tee koneesi asetukset valitsemalla Omenavalikosta Järjestelmäasetukset. Tuotteen voit rekisteröidä osoitteessa: www.apple.com/register";

"MESSAGE_SPEAKER_CONNECTION_TITLE"		= "Apple-kaiuttimen miniliitäntään yhdistettyä laitetta ei voida tunnistaa.";
"MESSAGE_SPEAKER_CONNECTION"			= "Irrota laite. Liitä se sitten takaisin ja varmista, että liitin on kunnolla kiinni.";

"MESSAGE_CONNECTION_FAILED_TITLE"		= "Rekisteröintiäsi ei voitu lähettää.";
"MESSAGE_CONNECTION_FAILED"				= "Tietokone ei saa muodostettua yhteyttä Appleen, koska linja on varattu tai verkkoasetuksesi ovat väärin. Siirry takaisin muuttamaan asetuksia osoittamalla Yritä uudelleen tai voit lähettää rekisteröinnin myöhemmin.";
"MESSAGE_CONNECTION_FAILED_REGLATER"	= "Yhteys Appleen on varattu tai kone ei ole saanut yhteyttä internetiin. Varmista verkkoasetukset tai ota yhteys internetiin ennen rekisteröinnin lähettämistä.";

"MESSAGE_CONNECTION_CANCELED_TITLE"		= "Kumottu…";
"MESSAGE_CONNECTION_CANCELED"			= "Muista rekisteröidä myöhemmin.";

"MESSAGE_REGISTRATION_FAILED_TITLE"		= "Rekisteröintiäsi ei voida käsitellä tällä hetkellä.";
"MESSAGE_REGISTRATION_FAILED"			= "Voit suorittaa rekisteröinnin loppuun myöhemmin avaamalla Send Registration -tiedoston kotikansiossasi.";

"MESSAGE_AUTHENTICATION_FAILED_TITLE"	= "Tunnuksesi tiedot ovat virheelliset.";
"MESSAGE_AUTHENTICATION_FAILED"			= "ISP-palveluntarjoajasi ei hyväksynyt tietoja. Osoita Takaisin, korjaa tiedot ja yritä uudelleen.";

"MESSAGE_CC_VALIDATION_FAILED_TITLE"	= "Luottokorttiasi ei voitu käsitellä.";
"MESSAGE_CC_VALIDATION_FAILED"			= "Antamaasi luottokorttia ei voitu käyttää. Varmista että olet syöttänyt tiedot oikein osoittamalla Takaisin tai syötä toisen luottokortin numero ja yritä uudelleen. ";

"MESSAGE_INVALID_ADDRESS_TITLE"			= "Osoitetietojen kanssa on ongelmia.";
"MESSAGE_INVALID_ADDRESS"				= "Siirry taaksepäin osoittamalla Takaisin ja varmista että kaupunki, postinumero ja muut tiedot ovat oikein ja yritä uudelleen.";


"MESSAGE_INVALID_REGISTRATION_TITLE"	= "Ongelmia rekisteröintitietojesi kanssa.";
"MESSAGE_INVALID_FIRSTNAME"				= "Syötetty nimi ei ole oikea. Siirry taaksepäin osoittamalla Takaisin ja varmista etunimen oikeellisuus ja yritä uudelleen.";
"MESSAGE_INVALID_LASTNAME"				= "Syötetty nimi ei ole oikea. Siirry taaksepäin osoittamalla Takaisin ja varmista sukunimen oikeellisuus ja yritä uudelleen.";
"MESSAGE_INVALID_PHONE_NUMBER"			= "Syötetty puhelinnumero ei ole oikea. Siirry taaksepäin osoittamalla Takaisin ja varmista puhelinnumeron oikeellisuus ja yritä sitten uudelleen.";


"MESSAGE_NO_DIAL_TONE_TITLE"			= "Modeemi ei tunnista valintaääntä.";
"MESSAGE_NO_DIAL_TONE"					= "Varmista että modeemisi on liitetty ja osoita OK. Voit myös valita Älä huomioi valintaääntä -valintaruudun osoittamalla Kumoa.";

"MESSAGE_CC_IN_USE_TITLE"				= "Tiliä ei voida luoda tällä luottokortilla.";
"MESSAGE_CC_IN_USE"						= "Tätä luottokorttia on jo käytetty tilin luomiseen tämän palveluntarjoajan kanssa. Syötä toisen luottokortin tiedot osoittamalla Takaisin tai ota yhteys palveluntarjoajaan.";

"MESSAGE_DOTMAC_WEB_CANCELLED_TITLE"	= "MobileMe-rekisteröintiprosessi kumottiin.";
"MESSAGE_DOTMAC_WEB_CANCELLED"			= "Voit yrittää yhdistää MobileMehen uudelleen osoittamalla Yritä uudelleen tai kumota MobileMe-kirjautumisprosessin ja jatkaa tietokoneen käyttöönottoa.";

"MESSAGE_NO_HINT_WARNING_TITLE"			= "Et ole antanut salasanavihjettä.";
"MESSAGE_NO_HINT_WARNING"				= "Oletko varma, ettet halua syöttää salasanavihjettä? Jos salasanasi unohtuu, sinun tulee asettaa salasana uudelleen.";

// ---------------------------------------------------------------------
// * Quit prematually
// ---------------------------------------------------------------------
"MESSAGE_QUIT_NO_LOCAL_ACCOUNT_TITLE" = "Haluatko sammuttaa tietokoneen?";
"MESSAGE_QUIT_NO_LOCAL_ACCOUNT" = "Et ole viimeistellyt Mac OS X:n käyttöönottoa.";
"MESSAGE_QUIT_NO_LOCAL_ACCOUNT_CAN_SKIP" = "Et ole viimeistellyt Mac OS X:n käyttöönottoa. Voit ohittaa rekisteröinnin osoittamalla Ohita.";

"MESSAGE_QUIT_TITLE" = "Haluatko varmasti lopettaa?";

"MESSAGE_QUIT_NO_REGISTRATION"  = "Jos lopetat nyt ei rekisteröintiäsi lähetetä Applelle.";
"MESSAGE_QUIT_REGISTER_LATER" = "Jos haluat jatkaa asetuksia, mutta et halua täyttää rekisteröintiä, osoita Myöhemmin.";

"MESSAGE_CANCEL_TITLE" = "Oletko varma?";

"MESSAGE_SKIP_USER_INFO" = "Jos et halua lähettää henkilötietoja, osoita Jatka.";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "Tapahtui odottamaton virhe.";
"MESSAGE_FATAL_ERROR_TITLE"		= "Valitan, tapahtui odottamaton virhe.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Virhe";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Pahoittelemme…";

// ---------------------------------------------------------------------
// * Support API error
// ---------------------------------------------------------------------
"ERROR_MESSAGE_NetworkConfigure"		= "[Verkon määrittely epäonnistui]";
"ERROR_MESSAGE_ICConfigure"				= "[Internet-asetukset epäonnistuivat]";
"ERROR_MESSAGE_UserConfigureFirstTime" 	= "[Paikallisen tunnuksen luominen epäonnistui]";

"ERROR_MESSAGE_NetworkConfigureFailed" = "Verkkoyhteyttä ei voitu määritellä.  Et voi lähettää rekisteröintitietojasi tai luoda Internet-yhteyttä.  Muuta verkkoasetukset osoittamalla Kumoa tai osoita OK ja lopeta asennus.";
// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Valitan";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Varoitus";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Haluatko jatkaa?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "Et ole antanut kaikkia tarvittavia tietoja.";
"ERROR_MESSAGE_VALIDATION_0001" = "Voit syöttää tiedot osoittamalla Takaisin ja tarkistamalla punaisilla nuolilla merkityt kentät.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "Antamasi teksti on liian lyhyt.";
"ERROR_MESSAGE_VALIDATION_0002" = "Tarkista korostettu kenttä ja korjaa teksti.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "Syöttämäsi tiedot ovat virheellisiä. Syötä tiedot uudelleen ja varmista, että tiedot ovat oikein.";

                    // NI Username/Password invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "Syöttämäsi käyttäjätunnus tai salasana on väärä tai sisäänkirjautuminen on estetty.";
"ERROR_MESSAGE_VALIDATION_0004" = "Syötä tiedot uudelleen tai ota yhteyttä palvelun ylläpitäjään.";

                    // NI Password invalid 
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "Syöttämäsi käyttäjätunnus tai salasana on väärä tai sisäänkirjautuminen on estetty.";
"ERROR_MESSAGE_VALIDATION_0005" = "Syötä tiedot uudelleen tai ota yhteyttä palvelun ylläpitäjään.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "Syöttämääsi nimeä ei voida käyttää.";
"ERROR_MESSAGE_VALIDATION_0006" = "Tarkista korostettu kenttä ja syötä toinen käyttäjätunnus.";

"ERROR_MESSAGE_VALIDATION_0007_TITLE" = "Syöttämääsi nimeä ei voida käyttää.";
"ERROR_MESSAGE_VALIDATION_0007" = "Nimi ei ole käytettävissä. Syötä toinen nimi.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "IP-osoitekenttä on tyhjä. Syötä IP-osoite ja varmista, että osoite on oikein.";
"ERROR_MESSAGE_VALIDATION_0010" = "Syöttämäsi IP-osoite sisältää virheellisiä merkkejä. Syötä oikea IP-osoite uudelleen.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "Osoitteessa täytyy olla 4 osaa."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Tarkista korostettu kenttä ja syötä oikea osoite. Jos et tiedä osoitetta, kysy sitä verkon ylläpitäjältä.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "Osoitteessa täytyy olla 4 osaa."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Tarkista korostettu kenttä ja syötä oikea osoite. Jos et tiedä osoitetta, kysy sitä verkon ylläpitäjältä.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Osoitteen jokaisen osan tulee olla 1 - 3 merkkiä."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Tarkista korostettu kenttä ja syötä oikea osoite. Jos et tiedä osoitetta, kysy sitä verkon ylläpitäjältä.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "Antamasi osoite ei ole sallittu.";
"ERROR_MESSAGE_VALIDATION_0014" = "Tarkista korostettu kenttä ja syötä oikea osoite. Jos et tiedä osoitetta, kysy sitä verkon ylläpitäjältä.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "Antamasi aliverkon peite on virheellinen.";
"ERROR_MESSAGE_VALIDATION_0015" = "Tarkista korostettu kenttä ja anna oikea aliverkon peite. Jos et tiedä sitä, kysy verkon ylläpitäjältä.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "Tämänniminen Open Directory -tili on jo olemassa. Jos käytät tätä nimeä, et voi käyttää nykyistä tiliä.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "Kentät eivät voi käyttää samaa arvoa.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "Syötetty salasana on virheellinen.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "Antamaasi luottokorttinumeroa ei voida käyttää.";
"ERROR_MESSAGE_VALIDATION_0019" = "Tarkista korostettu kenttä ja anna oikea luottokorttinumero.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "Käyttäjätunnus ei voi alkaa numerolla.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "Syöttämäsi sähköpostiosoite saattaa olla käyttökelvoton.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "IP-osoite ja reitittimen osoite eivät ole yhdenmukaisia antamasi aliverkon peitteen kanssa. Tarkista seuraavat kentät ja anna oikeat arvot:\n     IP-osoite\n     Aliverkon peite\n     Reitittimen osoite\nJos nämä tiedot eivät ole tiedossasi, kysy verkon ylläpitäjältä.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "Syöttämääsi nimeä ei voida käyttää.";
"ERROR_MESSAGE_VALIDATION_0023" = "Tarkista korostettu kenttä ja syötä toinen nimi.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "Osa tiedoista on samoja.";
"ERROR_MESSAGE_VALIDATION_0024" = "Tarkista korostettu kenttä ja syötä yksilölliset arvot.";

					// Wireless join errors
"ERROR_MESSAGE_VALIDATION_0025_TITLE" = "Tietokone ei ole tukiaseman käyttöoikeusluettelossa.";
"ERROR_MESSAGE_VALIDATION_0025" = "Lisää tietokone tukiaseman käyttöoikeusluetteloon.";
"ERROR_MESSAGE_VALIDATION_0026_TITLE" = "Liityttäessä valittuun verkkoon tapahtui virhe.";
"ERROR_MESSAGE_VALIDATION_0026" = "Tarkista AirPort-asetukset tai yritä liittyä toiseen verkkoon.";
					
                    // Required field for registration
"ERROR_MESSAGE_VALIDATION_0027_TITLE" = "Jotkin rekisteröintitiedot puuttuvat.";
"ERROR_MESSAGE_VALIDATION_0027" = "Voit syöttää tiedot osoittamalla Takaisin ja tarkistamalla punaisilla nuolilla merkityt kentät.";

                    // Registration server validation (from 1000-)
"ERROR_MESSAGE_VALIDATION_1000" = "Syötä oikea postinumero.";
"ERROR_MESSAGE_VALIDATION_1001" = "Anna oikea suuntanumero.";
"ERROR_MESSAGE_VALIDATION_1002" = "Anna toimiva paikallisnumero.";
"ERROR_MESSAGE_VALIDATION_1003" = "Anna oikea puhelinnumero.";

                    // AppleCareAgreement validation (from 2000-)
"ERROR_MESSAGE_VALIDATION_2000_TITLE" = "Syötetty sopimusnumero on virheellinen.";
"ERROR_MESSAGE_VALIDATION_2000" = "Sopimusnumeron on oltava 12 - 15 merkkiä pitkä.";

                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "Salasanat eivät täsmää.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Tarkista punaisilla nuolilla merkityt kentät ja anna sama salasana molempiin kenttiin.";

"ERROR_NO_PASSWORD_INSECURE_TITLE" = "Käyttäjätunnukselle ei ole syötetty salasanaa.";
"ERROR_NO_PASSWORD_INSECURE" = "Jos käyttäjätunnuksella ei ole salasanaa, tietokone ei ole turvallinen. Syötä salasana osoittamalla Kumoa.";

"ERROR_NIUSERNAME_EXISTS_LONGNAME_TITLE" = "Open Directory -tili, jolla on tämä pitkä nimi, on jo olemassa.";
"ERROR_NIUSERNAME_EXISTS_LONGNAME" = "Jos käytät tätä nimeä, et voi käyttää nykyistä käyttäjätunnusta. Haluatko varmasti luoda tämän nimisen paikallisen tunnuksen?";

"ERROR_NIUSERNAME_EXISTS_SHORTNAME_TITLE" = "Open Directory -tili, jolla on tämä nimi, on jo olemassa.";
"ERROR_NIUSERNAME_EXISTS_SHORTNAME" = "Jos käytät tätä nimeä, et voi käyttää nykyistä käyttäjätunnusta. Haluatko varmasti luoda tämän nimisen paikallisen tunnuksen?";

"ERROR_IP_AND_ROUTER_TITLE" = "Haluatko varmasti, että IP-osoite ja reitittimen osoite ovat samat?";
"ERROR_IP_AND_ROUTER" = "Sama IP- ja reitittimen osoite saattaa aiheuttaa verkko-ongelmia. Jos et tiedä IP- ja reitittimen osoitetta, ota yhteyttä verkon ylläpitäjään ennen kuin jatkat.";

"ERROR_POSTAL_USA_TITLE" = "Postinumero on väärä.";
"ERROR_POSTAL_USA" = "Postinumeron täytyy olla 5 merkkiä,  tai 9 merkkiä (yhdistetty postinumero + 4 merkkiä), pitkä ja muotoa XXXXX-XXXX, missä X merkitsee postinumeron numeroa.";

"ERROR_POSTAL_JAPAN_TITLE" = "Antamasi postiosoite on väärin.";
"ERROR_POSTAL_JAPAN" = "Postinumeron tulee olla 7 numeroa ja sen täytyy olla muotoa XXX-XXXX, missä X merkitsee postinumeron numeroa.";

"ERROR_POSTAL_OTHER_TITLE" = "Antamasi postiosoite on väärin.";
"ERROR_POSTAL_OTHER" = "Postinumeron tulee olla alle 32 merkkiä pitkä.";

"ERROR_AREA_CODE_CANADA_USA_TITLE" = "Antamasi suuntanumero ei ole oikein.";
"ERROR_AREA_CODE_CANADA_USA" = "Suuntanumeron täytyy olla suurempi kuin 200, eikä voi olla 411, 611 tai 911.";

"ERROR_LOCAL_NUMBER_CANADA_USA_TITLE" = "Paikallinen puhelinnumero on väärin.";
"ERROR_LOCAL_NUMBER_CANADA_USA" = "Suuntanumeron on oltava suurempi kuin 200 eikä se voi olla 411, 611 tai 911. Syötä oikea puhelinnumerosi uudelleen.";

"ERROR_EXCHANGE_NUMBER_CANADA_USA_TITLE" = "Paikallinen puhelinnumero on väärin.";
"ERROR_EXCHANGE_NUMBER_CANADA_USA" = "Syöttämäsi suuntanumeron etuliite ei voi olla 555. Syötä oikea puhelinnumerosi uudelleen.";

"ERROR_PHONE_NUMBER_JAPAN_TITLE" = "Antamasi puhelinnumero ei ole oikea.";
"ERROR_PHONE_NUMBER_JAPAN" = "Puhelinnumerossa on oltava vähintään 10 numeroa.";

"ERROR_PHONE_NUMBER_CANADA_USA_TITLE" = "Antamasi puhelinnumero ei ole oikea.";
"ERROR_PHONE_NUMBER_CANADA_USA" = "Puhelinnumerossa täytyy olla 10 numeroa.";

"ERROR_USERNAME_AND_PASSWORD_TITLE" = "Käyttäjätunnus ja salasana eivät voi olla samoja.";
"ERROR_USERNAME_AND_PASSWORD"		= "Tämä on turvallisuusriski. Syötä toinen salasana.";

"ERROR_UNIQUE_DNS_ENTRIES_TITLE" = "On samoja DNS-syöttöjä.";
"ERROR_UNIQUE_DNS_ENTRIES"		= "Tarkista korostettu kenttä ja syötä yksilölliset DNS-arvot.";

"ERROR_PASSWORD_CANNOT_BE_HINT_TITLE" = "Vihje ja salasana eivät voi olla samoja.";
"ERROR_PASSWORD_CANNOT_BE_HINT"		= "Tämä on turvallisuusriski. Syötä toinen vihje tai salasana.";

"American Express"			= "American Express";
"MasterCard"				= "MasterCard";
"Visa"					= "VISA";
"JCB"					= "JCB";
"E-On"					= "E-On";
"Million"				= "Million";
"Internet Service Plan"                 = "Internet-palveluratkaisu";

"FADE_STRING_1" = "Mac OS X 10.5 Leopard";
"FADE_STRING_2" = "Alkutoimet";
